{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_14", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_14_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, 17], "dtype": "float32", "input_dim": 913, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 17}}, {"class_name": "LSTM", "config": {"name": "lstm_28", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_14", "trainable": true, "dtype": "float32", "n": 18}}, {"class_name": "LSTM", "config": {"name": "lstm_29", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_14", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 809, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "embedding_14/embeddings", "shape": [913, 256], "dtype": "float32"}, {"name": "lstm_28/lstm_cell_42/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_28/lstm_cell_42/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_28/lstm_cell_42/bias", "shape": [1024], "dtype": "float32"}, {"name": "lstm_29/lstm_cell_43/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_29/lstm_cell_43/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_29/lstm_cell_43/bias", "shape": [1024], "dtype": "float32"}, {"name": "time_distributed_14/kernel", "shape": [256, 809], "dtype": "float32"}, {"name": "time_distributed_14/bias", "shape": [809], "dtype": "float32"}]}]}